AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/BatteryCooling/case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.0;

boundaryField
{

    battery
    {
        type            externalWallHeatFluxTemperature;
        mode            power;
        Q               2000.0;
        kappaMethod     fluidThermo;
        value           $internalField;
    }

    inlet
    {
        type        inletOutlet;
        inletValue  uniform 293.0;
        value       uniform 293.0;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform 300.0;
        value       uniform 300.0;
    }

    wall
    {
        type        zeroGradient;
        value       $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
        value       $internalField;
    }

}

// ************************************************************************* //
