AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/BatteryCooling/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 110000.0;

boundaryField
{

    battery
    {
        type        calculated;
        value       $internalField;
    }

    inlet
    {
        type        calculated;
        value       $internalField;
    }

    outlet
    {
        type        calculated;
        value       $internalField;
    }

    wall
    {
        type        calculated;
        value       $internalField;
    }

    defaultFaces
    {
        type        calculated;
        value       $internalField;
    }

}

// ************************************************************************* //
